{
  "main": {
    "intro":"Hello, I am Jayraj Nimbalkar",
    "name" : "Jayraj Nimbalkar",
    "description":"I Build, Lead, and Own Mission-Critical Financial Technology Platforms",
    "image":"profilepic.png",
    "bio": "I am a Senior Technology Leader with 12+ years of experience transforming regulated fintech environments into modern, cloud-native, API-first ecosystems. I’ve partnered with leading banks and fintech firms to deliver enterprise-scale digital transformations—accelerating time-to-market by 40% and unlocking multimillion-pound revenue growth within months.\n\nAs Director of Technology at FCamara UK and Interim Principal Engineer for Birmingham Bank, I’ve led the architecture and launch of fully digital savings and lending platforms. This included migrating legacy infrastructure to Mambu and Azure, enabling AI-driven MFA, and implementing biometric KYC/KYB processes. These initiatives onboarded 5,600+ customers, grew deposit accounts by 225%, automated 19,000+ transactions, and processed £295M+ in digital payments—all while maintaining 99.9% uptime and ensuring PCI DSS, GDPR, and FS compliance.\n\nI’ve built and mentored high-performing teams of 25+ professionals, advised executive committees, and shaped global delivery strategies across the UK, Brazil, and Portugal. My expertise spans enterprise architecture (microservices, event-driven systems, DDD), digital product innovation, and operational resilience—underpinned by deep technical leadership in Azure, AWS, .NET Core, DevOps, and secure financial integrations.\n\nDriven by a passion for technology and strategic impact, I focus on aligning engineering excellence with business growth—delivering scalable solutions and empowering teams to innovate in highly regulated markets.\n\n💡 And despite all the leadership titles… I’m still a developer at heart—often found scratching my head over complex code just like day one.",
    "contactmessage":"Want to get in touch, contact me!",
    "email": "jayraj@avalphatechnologies.com",
    "phone": "+447775236983/+919730323898",
    "github":"https://github.com/jayraj701",
    "project":"https://github.com/jayraj701?tab=projects",
    "address":{
      "street":"",
      "city":"St Albans",
      "state":"Hertfordshire",
      "zip": "UK/ Remote"
    },
    "website": "",
    "resumedownload":"https://jayresume.blob.core.windows.net/resume/Jayraj_CV.pdf",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/jayraj.nimbalkar.1829",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/nimbalkarjayraj",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/jayrajnimbalkar",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/nimbalkarjayraj",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/jayraj701",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"Pune University",
        "degree":"Bachelor of Engineering",
        "graduated":"May 2013",
        "description":"Bachelor of Engineering in Information Technology"
      }
    ],
    "work":[
      {
        "company":"FCamara UK",
        "logo":"images/fcamara.png",
        "title":"Principal Engineer",
        "years":"Mar 2022 - Present",
        "tech": "Azure, AWS, .NET Core, C#, REST API, SQL, Python, JavaScript, React, Microservices, DDD,BDD, Event-Driven Systems, CRM, Resilience Design",
        "description":"As a Principal Engineer and Strategic Technology Leader at FCamara UK, I’m responsible for shaping technology strategy, driving high-impact digital transformations, and enabling global delivery excellence. My role spans executive advisory, enterprise architecture, and operational leadership, ensuring FCamara consistently delivers world-class fintech and digital banking solutions.\n\n🌍 Strategic Leadership\n- Advising the Executive Committee of BakerOnline, a €350M digital commerce platform serving 800+ SMBs, on technical growth strategy, platform scalability, and build-vs-buy evaluations.\n- Partnering with C-level stakeholders to assess technology capabilities, identify modernization opportunities, and guide strategic investments in digital platforms.\n- Leading due diligence efforts for large-scale technology assessments, ensuring secure, compliant, and future-proof solutions.\n\n🏦 Digital Banking & FinTech Expertise\n- Led end-to-end cloud-native transformations for leading financial institutions, including Birmingham Bank:\n  - Migrated legacy banking systems (CORTEN) to Mambu, Azure, and AWS.\n  - Architected event-driven microservices, ensuring resilience, observability, and security (PCI DSS, GDPR).\n  - Delivered fully automated transaction processing handling £295M+ and 19K+ transactions with zero downtime.\n  - Directed development and rollout of Online Banking, Savings Product Marketplace, Omnichannel Platform, and multiple regulatory reporting pipelines (WhistleBrook WIRES ETLs).\n  - Integrated with 15+ fintech providers (Mambu, nCino, LexisNexis, Equifax, Callsign, AccessPay, ClearBank, Tink) to enable scalable, compliant financial services.\n\n👥 Team Leadership & Culture\n- Scaled and managed a 25+ cross-functional global team, including Tech Managers, Engineers, Product Owners, and UX Researchers.\n- Fostered a security-first, ownership-driven culture, enabling rapid yet compliant delivery of mission-critical solutions.\n- Implemented notifications, auditing, secure access policies, and workflow automation to enhance operational resilience and transparency.\n\n📈 Business Impact\n- 1,800% increase in digital customer onboarding (300 → 5,668)\n- 225% increase in deposit accounts (2,000 → 6,540)\n- 100% automation of transaction flows, scaling to 19K+ transactions\n- Reduced onboarding and processing times by 60% while maintaining 99.9% uptime\n- Delivered strategic build-vs-buy assessments and vendor management, ensuring cost-effective, scalable solutions\n\n⚡ Global Delivery Framework\n- Designed and operationalized FCamara’s Global Delivery Framework, enabling seamless international delivery from Brazil, Portugal, UK, US, and Belgium.\n- Reduced talent deployment time by 80% through streamlined mobilization, intelligent resource planning, and optimized DevOps readiness.\n- Established governance, visibility dashboards, and delivery playbooks to ensure scalable, high-quality client onboarding and execution."
      },
      {
        "company":"VillaPlus",
        "logo":"images/villaplus.jpg",
        "title":"Senior Agile Developer",
        "years":"Dec 2018 - Mar 2022",
        "tech": "Azure, .net 5 Web API, Angular, Cosmos DB, SQL, Redis",
        "description":"As a Senior Software Engineer at VillaPlus, I played a key role in modernizing the company’s booking and payments platform. I was part of the core team that migrated a large monolithic system into a domain-driven microservices architecture hosted on Azure, covering domains such as E-commerce, Booking, Payments, Transfers, Car Hire, and Flights.\n\nI contributed to architectural design, disaster recovery planning, monitoring, alerting, CI/CD pipelines, and automated backup processes, ensuring resilience and scalability. I developed a unique, plug-and-play injectable payment interface in JavaScript, enabling seamless integration with major payment gateways including Braintree, NMI, Trust Payments, and AccessPay for both card transactions and Direct Debits.\n\nAdditionally, I led the development of ‘MyVillaPlus’, an Angular and .NET Core-based booking management platform, and ensured smooth synchronization between legacy and new systems during the migration phase, all while promoting TDD practices and high engineering standards."
      },
      {
        "company":"Ash Software",
        "logo":"images/ash.png",
        "title":"Programmer Analyst",
        "years":"Sept 2016 - Dec 2018",
        "tech": "Azure, ASP.NET MVC, .Net Core, Angular, SQL",
        "description":"I began my journey at Ash Software, where I focused on refactoring and modernizing the legacy booking engine by migrating it from ASP.NET WebForms to MVC, laying the foundation for a modular architecture and the upcoming website revamp. I also introduced configurable home and customer landing pages, setting the stage for future CMS integration (Prismic) to enable more dynamic content management.\n\nIn this phase, I led a team of three junior developers in building a new post-sale customer booking management product—‘MyVillaPlus’—developed in Angular and .NET Core. This initiative marked the first step toward transitioning from a tightly coupled legacy system to a scalable, customer-centric platform, paving the way for the later full microservices migration and digital transformation efforts at VillaPlus."
      },
      {
        "company":"Atos",
        "logo":"images/atos.png",
        "title":"Senior Software Engineer",
        "years":"Aug 2013 - Sept 2016",
        "tech": "Tech Stack: ASP.NET, TFS,VSS, XSLT, HTML, CSS, JavaScript",
        "description":"I began my professional journey with Atos as an Associate Engineer, working closely with a UK-based client (OHS) and later contributing to the in-house Bit Solution Tool. This role gave me early exposure to European engineering standards, cross-border collaboration, and enterprise-grade software delivery.\n\nDuring my three years at Atos, I developed strong foundations in .NET development, SDLC best practices, and agile delivery, while continuously learning from experienced European engineering teams. My commitment to quality, ownership, and technical excellence enabled me to progress rapidly from Associate Engineer to Senior Software Engineer, a milestone achieved through consistent delivery and recognition of my contributions to high-impact projects."
      }
    ],
    "skills": [
      { "name": "Azure" },
      { "name": "AWS" },
      { "name": ".NET Core / .NET5 / .NET6" },
      { "name": "C#" },
      { "name": "REST API" },
      { "name": "SQL" },
      { "name": "Python" },
      { "name": "JavaScript" },
      { "name": "React" },
      { "name": "Microservices" },
      { "name": "DDD" },
      { "name": "BDD" },
      { "name": "Event-Driven Systems" },
      { "name": "CRM" },
      { "name": "Resilience Design" },
      { "name": "Angular" },
      { "name": "Cosmos DB" },
      { "name": "Redis" },
      { "name": "ASP.NET MVC" },
      { "name": "HTML" },
      { "name": "CSS" },
      { "name": "TFS" },
      { "name": "VSS" },
      { "name": "XSLT" }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Migrating existing .net 5 web application to MSAL Authentication",
        "category":"Technical",
        "image":"01.jpg",
        "url":"https://jayraj701.medium.com/migrating-existing-net-5-web-application-to-msal-authentication-9388dcaf373c"
      },
      {
        "title":"Deploy Static HTML UI on Azure Web App using FTP Client",
        "category":"Technical",
        "image":"02.jpg",
        "url":"https://jayraj701.medium.com/deploy-static-html-ui-on-azure-web-app-using-ftp-client-d7ef0b7228e2"
      },
      {
        "title":"Deploy your Python Flask API on Linux Based Azure App Service Using Github Actions",
        "category":"Technical",
        "image":"03.jpg",
        "url":"https://python.plainenglish.io/deploy-your-python-flask-api-on-linux-based-azure-app-service-using-github-actions-5a54d5f9807"
      }     
    ]
  }
}
